app/controllers/shipments_controller.rb

SELECT "shipments".* FROM "shipments"
---
  def index
    @shipments = Shipment.all

SELECT  "shipments".* FROM "shipments" WHERE (lower(gbl_no) LIKE %156% OR lower(atlas_no) LIKE %156% OR lower(o_name) LIKE %156% OR lower(d_name) LIKE %156% OR lower(o_city) LIKE %156% OR lower(d_city) LIKE %156% OR lower(o_state) LIKE %156% OR lower(d_state) LIKE %156% OR o_zip LIKE %156% OR d_zip LIKE %156% OR o_phone LIKE %156% OR d_phone LIKE %156% OR o_cell LIKE %156% OR d_cell LIKE %156%) LIMIT 20 OFFSET 0
---
  def shipment_search
    @shipments = Search.search_shipments(params[:search_term]).paginate(:page => params[:page], :per_page => 20)

INSERT INTO "shipments" ("company_id", "discount", "notes", "user_id", "origin_agent", "dest_agent", "carrier", "reg_no", "atlas_no", "gbl_no", "move_type", "hauler", "surveyor", "booker", "o_name", "o_address", "o_city", "o_state", "o_zip", "o_phone", "o_cell", "o_notes", "d_name", "d_address", "d_city", "d_state", "d_zip", "d_phone", "d_cell", "d_notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
  def create
    @shipment = Shipment.new(shipment_params)

    respond_to do |format|
      if @shipment.save

UPDATE "shipments" SET "pack_date" = $1, "pick_date" = $2, "deliver_date" = $3, "updated_at" = $4 WHERE "shipments"."id" = $5  [["pack_date", "2015-11-19"], ["pick_date", "2015-11-19"], ["deliver_date", "2015-11-19"], ["updated_at", "2015-11-19 04:57:19.010967"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @shipment.update(shipment_params)

SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_shipment
      @shipment = Shipment.find(params[:id])