app/views/shipments/_form.html.erb

SELECT "companies".* FROM "companies"
---

  <%= f.input :company_id, :as => :select, :collection => Company.all.map {|p| [p.name, p.id]}, :prompt => "Select"  %>